## Production: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                        |
|--------|----------------------------------------------------|
| add    | `aws_ssm_parameter.azure_openai_embedding_api_key` |
|        | `aws_ssm_parameter.google_api_key`                 |
| delete | `aws_ssm_parameter.google_ai_api_key`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ssm_parameter.azure_openai_embedding_api_key will be created
  + resource "aws_ssm_parameter" "azure_openai_embedding_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_embedding_api_key"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.google_ai_api_key will be destroyed
  # (because aws_ssm_parameter.google_ai_api_key is not in configuration)
  - resource "aws_ssm_parameter" "google_ai_api_key" {
      - arn             = "arn:aws:ssm:ca-central-1:730335533085:parameter/google_ai_api_key" -> null
      - data_type       = "text" -> null
      - id              = "google_ai_api_key" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "google_ai_api_key" -> null
      - tags            = {
          - "CostCentre" = "ai-answers-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "ai-answers-prod"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - version         = 2 -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ssm_parameter.google_api_key will be created
  + resource "aws_ssm_parameter" "google_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "google_api_key"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + azure_openai_embedding_api_key_arn = (known after apply)
  - google_ai_api_key_arn              = "arn:aws:ssm:ca-central-1:730335533085:parameter/google_ai_api_key" -> null
  + google_api_key_arn                 = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
